# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.19-s055_1 on Thu Dec 26 01:29:36 CET 2024

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design BRISC_top_no_io

create_clock -name "CLK" -period 100.0 -waveform {0.0 50.0} [get_ports clk]
set_load -pin_load -min 0.01 [get_ports {data_addr_wire_out[31]}]
set_load -pin_load -max 0.1 [get_ports {data_addr_wire_out[31]}]
set_load -pin_load -min 0.01 [get_ports {data_addr_wire_out[30]}]
set_load -pin_load -max 0.1 [get_ports {data_addr_wire_out[30]}]
set_load -pin_load -min 0.01 [get_ports {data_addr_wire_out[29]}]
set_load -pin_load -max 0.1 [get_ports {data_addr_wire_out[29]}]
set_load -pin_load -min 0.01 [get_ports {data_addr_wire_out[28]}]
set_load -pin_load -max 0.1 [get_ports {data_addr_wire_out[28]}]
set_load -pin_load -min 0.01 [get_ports {data_addr_wire_out[27]}]
set_load -pin_load -max 0.1 [get_ports {data_addr_wire_out[27]}]
set_load -pin_load -min 0.01 [get_ports {data_addr_wire_out[26]}]
set_load -pin_load -max 0.1 [get_ports {data_addr_wire_out[26]}]
set_load -pin_load -min 0.01 [get_ports {data_addr_wire_out[25]}]
set_load -pin_load -max 0.1 [get_ports {data_addr_wire_out[25]}]
set_load -pin_load -min 0.01 [get_ports {data_addr_wire_out[24]}]
set_load -pin_load -max 0.1 [get_ports {data_addr_wire_out[24]}]
set_load -pin_load -min 0.01 [get_ports {data_addr_wire_out[23]}]
set_load -pin_load -max 0.1 [get_ports {data_addr_wire_out[23]}]
set_load -pin_load -min 0.01 [get_ports {data_addr_wire_out[22]}]
set_load -pin_load -max 0.1 [get_ports {data_addr_wire_out[22]}]
set_load -pin_load -min 0.01 [get_ports {data_addr_wire_out[21]}]
set_load -pin_load -max 0.1 [get_ports {data_addr_wire_out[21]}]
set_load -pin_load -min 0.01 [get_ports {data_addr_wire_out[20]}]
set_load -pin_load -max 0.1 [get_ports {data_addr_wire_out[20]}]
set_load -pin_load -min 0.01 [get_ports {data_addr_wire_out[19]}]
set_load -pin_load -max 0.1 [get_ports {data_addr_wire_out[19]}]
set_load -pin_load -min 0.01 [get_ports {data_addr_wire_out[18]}]
set_load -pin_load -max 0.1 [get_ports {data_addr_wire_out[18]}]
set_load -pin_load -min 0.01 [get_ports {data_addr_wire_out[17]}]
set_load -pin_load -max 0.1 [get_ports {data_addr_wire_out[17]}]
set_load -pin_load -min 0.01 [get_ports {data_addr_wire_out[16]}]
set_load -pin_load -max 0.1 [get_ports {data_addr_wire_out[16]}]
set_load -pin_load -min 0.01 [get_ports {data_addr_wire_out[15]}]
set_load -pin_load -max 0.1 [get_ports {data_addr_wire_out[15]}]
set_load -pin_load -min 0.01 [get_ports {data_addr_wire_out[14]}]
set_load -pin_load -max 0.1 [get_ports {data_addr_wire_out[14]}]
set_load -pin_load -min 0.01 [get_ports {data_addr_wire_out[13]}]
set_load -pin_load -max 0.1 [get_ports {data_addr_wire_out[13]}]
set_load -pin_load -min 0.01 [get_ports {data_addr_wire_out[12]}]
set_load -pin_load -max 0.1 [get_ports {data_addr_wire_out[12]}]
set_load -pin_load -min 0.01 [get_ports {data_addr_wire_out[11]}]
set_load -pin_load -max 0.1 [get_ports {data_addr_wire_out[11]}]
set_load -pin_load -min 0.01 [get_ports {data_addr_wire_out[10]}]
set_load -pin_load -max 0.1 [get_ports {data_addr_wire_out[10]}]
set_load -pin_load -min 0.01 [get_ports {data_addr_wire_out[9]}]
set_load -pin_load -max 0.1 [get_ports {data_addr_wire_out[9]}]
set_load -pin_load -min 0.01 [get_ports {data_addr_wire_out[8]}]
set_load -pin_load -max 0.1 [get_ports {data_addr_wire_out[8]}]
set_load -pin_load -min 0.01 [get_ports {data_addr_wire_out[7]}]
set_load -pin_load -max 0.1 [get_ports {data_addr_wire_out[7]}]
set_load -pin_load -min 0.01 [get_ports {data_addr_wire_out[6]}]
set_load -pin_load -max 0.1 [get_ports {data_addr_wire_out[6]}]
set_load -pin_load -min 0.01 [get_ports {data_addr_wire_out[5]}]
set_load -pin_load -max 0.1 [get_ports {data_addr_wire_out[5]}]
set_load -pin_load -min 0.01 [get_ports {data_addr_wire_out[4]}]
set_load -pin_load -max 0.1 [get_ports {data_addr_wire_out[4]}]
set_load -pin_load -min 0.01 [get_ports {data_addr_wire_out[3]}]
set_load -pin_load -max 0.1 [get_ports {data_addr_wire_out[3]}]
set_load -pin_load -min 0.01 [get_ports {data_addr_wire_out[2]}]
set_load -pin_load -max 0.1 [get_ports {data_addr_wire_out[2]}]
set_load -pin_load -min 0.01 [get_ports {data_addr_wire_out[1]}]
set_load -pin_load -max 0.1 [get_ports {data_addr_wire_out[1]}]
set_load -pin_load -min 0.01 [get_ports {data_addr_wire_out[0]}]
set_load -pin_load -max 0.1 [get_ports {data_addr_wire_out[0]}]
set_load -pin_load -min 0.01 [get_ports we_wire_out]
set_load -pin_load -max 0.1 [get_ports we_wire_out]
set_load -pin_load -min 0.01 [get_ports {data4mem_wire_out[31]}]
set_load -pin_load -max 0.1 [get_ports {data4mem_wire_out[31]}]
set_load -pin_load -min 0.01 [get_ports {data4mem_wire_out[30]}]
set_load -pin_load -max 0.1 [get_ports {data4mem_wire_out[30]}]
set_load -pin_load -min 0.01 [get_ports {data4mem_wire_out[29]}]
set_load -pin_load -max 0.1 [get_ports {data4mem_wire_out[29]}]
set_load -pin_load -min 0.01 [get_ports {data4mem_wire_out[28]}]
set_load -pin_load -max 0.1 [get_ports {data4mem_wire_out[28]}]
set_load -pin_load -min 0.01 [get_ports {data4mem_wire_out[27]}]
set_load -pin_load -max 0.1 [get_ports {data4mem_wire_out[27]}]
set_load -pin_load -min 0.01 [get_ports {data4mem_wire_out[26]}]
set_load -pin_load -max 0.1 [get_ports {data4mem_wire_out[26]}]
set_load -pin_load -min 0.01 [get_ports {data4mem_wire_out[25]}]
set_load -pin_load -max 0.1 [get_ports {data4mem_wire_out[25]}]
set_load -pin_load -min 0.01 [get_ports {data4mem_wire_out[24]}]
set_load -pin_load -max 0.1 [get_ports {data4mem_wire_out[24]}]
set_load -pin_load -min 0.01 [get_ports {data4mem_wire_out[23]}]
set_load -pin_load -max 0.1 [get_ports {data4mem_wire_out[23]}]
set_load -pin_load -min 0.01 [get_ports {data4mem_wire_out[22]}]
set_load -pin_load -max 0.1 [get_ports {data4mem_wire_out[22]}]
set_load -pin_load -min 0.01 [get_ports {data4mem_wire_out[21]}]
set_load -pin_load -max 0.1 [get_ports {data4mem_wire_out[21]}]
set_load -pin_load -min 0.01 [get_ports {data4mem_wire_out[20]}]
set_load -pin_load -max 0.1 [get_ports {data4mem_wire_out[20]}]
set_load -pin_load -min 0.01 [get_ports {data4mem_wire_out[19]}]
set_load -pin_load -max 0.1 [get_ports {data4mem_wire_out[19]}]
set_load -pin_load -min 0.01 [get_ports {data4mem_wire_out[18]}]
set_load -pin_load -max 0.1 [get_ports {data4mem_wire_out[18]}]
set_load -pin_load -min 0.01 [get_ports {data4mem_wire_out[17]}]
set_load -pin_load -max 0.1 [get_ports {data4mem_wire_out[17]}]
set_load -pin_load -min 0.01 [get_ports {data4mem_wire_out[16]}]
set_load -pin_load -max 0.1 [get_ports {data4mem_wire_out[16]}]
set_load -pin_load -min 0.01 [get_ports {data4mem_wire_out[15]}]
set_load -pin_load -max 0.1 [get_ports {data4mem_wire_out[15]}]
set_load -pin_load -min 0.01 [get_ports {data4mem_wire_out[14]}]
set_load -pin_load -max 0.1 [get_ports {data4mem_wire_out[14]}]
set_load -pin_load -min 0.01 [get_ports {data4mem_wire_out[13]}]
set_load -pin_load -max 0.1 [get_ports {data4mem_wire_out[13]}]
set_load -pin_load -min 0.01 [get_ports {data4mem_wire_out[12]}]
set_load -pin_load -max 0.1 [get_ports {data4mem_wire_out[12]}]
set_load -pin_load -min 0.01 [get_ports {data4mem_wire_out[11]}]
set_load -pin_load -max 0.1 [get_ports {data4mem_wire_out[11]}]
set_load -pin_load -min 0.01 [get_ports {data4mem_wire_out[10]}]
set_load -pin_load -max 0.1 [get_ports {data4mem_wire_out[10]}]
set_load -pin_load -min 0.01 [get_ports {data4mem_wire_out[9]}]
set_load -pin_load -max 0.1 [get_ports {data4mem_wire_out[9]}]
set_load -pin_load -min 0.01 [get_ports {data4mem_wire_out[8]}]
set_load -pin_load -max 0.1 [get_ports {data4mem_wire_out[8]}]
set_load -pin_load -min 0.01 [get_ports {data4mem_wire_out[7]}]
set_load -pin_load -max 0.1 [get_ports {data4mem_wire_out[7]}]
set_load -pin_load -min 0.01 [get_ports {data4mem_wire_out[6]}]
set_load -pin_load -max 0.1 [get_ports {data4mem_wire_out[6]}]
set_load -pin_load -min 0.01 [get_ports {data4mem_wire_out[5]}]
set_load -pin_load -max 0.1 [get_ports {data4mem_wire_out[5]}]
set_load -pin_load -min 0.01 [get_ports {data4mem_wire_out[4]}]
set_load -pin_load -max 0.1 [get_ports {data4mem_wire_out[4]}]
set_load -pin_load -min 0.01 [get_ports {data4mem_wire_out[3]}]
set_load -pin_load -max 0.1 [get_ports {data4mem_wire_out[3]}]
set_load -pin_load -min 0.01 [get_ports {data4mem_wire_out[2]}]
set_load -pin_load -max 0.1 [get_ports {data4mem_wire_out[2]}]
set_load -pin_load -min 0.01 [get_ports {data4mem_wire_out[1]}]
set_load -pin_load -max 0.1 [get_ports {data4mem_wire_out[1]}]
set_load -pin_load -min 0.01 [get_ports {data4mem_wire_out[0]}]
set_load -pin_load -max 0.1 [get_ports {data4mem_wire_out[0]}]
set_load -pin_load -min 0.01 [get_ports {data2mem_wire_out[31]}]
set_load -pin_load -max 0.1 [get_ports {data2mem_wire_out[31]}]
set_load -pin_load -min 0.01 [get_ports {data2mem_wire_out[30]}]
set_load -pin_load -max 0.1 [get_ports {data2mem_wire_out[30]}]
set_load -pin_load -min 0.01 [get_ports {data2mem_wire_out[29]}]
set_load -pin_load -max 0.1 [get_ports {data2mem_wire_out[29]}]
set_load -pin_load -min 0.01 [get_ports {data2mem_wire_out[28]}]
set_load -pin_load -max 0.1 [get_ports {data2mem_wire_out[28]}]
set_load -pin_load -min 0.01 [get_ports {data2mem_wire_out[27]}]
set_load -pin_load -max 0.1 [get_ports {data2mem_wire_out[27]}]
set_load -pin_load -min 0.01 [get_ports {data2mem_wire_out[26]}]
set_load -pin_load -max 0.1 [get_ports {data2mem_wire_out[26]}]
set_load -pin_load -min 0.01 [get_ports {data2mem_wire_out[25]}]
set_load -pin_load -max 0.1 [get_ports {data2mem_wire_out[25]}]
set_load -pin_load -min 0.01 [get_ports {data2mem_wire_out[24]}]
set_load -pin_load -max 0.1 [get_ports {data2mem_wire_out[24]}]
set_load -pin_load -min 0.01 [get_ports {data2mem_wire_out[23]}]
set_load -pin_load -max 0.1 [get_ports {data2mem_wire_out[23]}]
set_load -pin_load -min 0.01 [get_ports {data2mem_wire_out[22]}]
set_load -pin_load -max 0.1 [get_ports {data2mem_wire_out[22]}]
set_load -pin_load -min 0.01 [get_ports {data2mem_wire_out[21]}]
set_load -pin_load -max 0.1 [get_ports {data2mem_wire_out[21]}]
set_load -pin_load -min 0.01 [get_ports {data2mem_wire_out[20]}]
set_load -pin_load -max 0.1 [get_ports {data2mem_wire_out[20]}]
set_load -pin_load -min 0.01 [get_ports {data2mem_wire_out[19]}]
set_load -pin_load -max 0.1 [get_ports {data2mem_wire_out[19]}]
set_load -pin_load -min 0.01 [get_ports {data2mem_wire_out[18]}]
set_load -pin_load -max 0.1 [get_ports {data2mem_wire_out[18]}]
set_load -pin_load -min 0.01 [get_ports {data2mem_wire_out[17]}]
set_load -pin_load -max 0.1 [get_ports {data2mem_wire_out[17]}]
set_load -pin_load -min 0.01 [get_ports {data2mem_wire_out[16]}]
set_load -pin_load -max 0.1 [get_ports {data2mem_wire_out[16]}]
set_load -pin_load -min 0.01 [get_ports {data2mem_wire_out[15]}]
set_load -pin_load -max 0.1 [get_ports {data2mem_wire_out[15]}]
set_load -pin_load -min 0.01 [get_ports {data2mem_wire_out[14]}]
set_load -pin_load -max 0.1 [get_ports {data2mem_wire_out[14]}]
set_load -pin_load -min 0.01 [get_ports {data2mem_wire_out[13]}]
set_load -pin_load -max 0.1 [get_ports {data2mem_wire_out[13]}]
set_load -pin_load -min 0.01 [get_ports {data2mem_wire_out[12]}]
set_load -pin_load -max 0.1 [get_ports {data2mem_wire_out[12]}]
set_load -pin_load -min 0.01 [get_ports {data2mem_wire_out[11]}]
set_load -pin_load -max 0.1 [get_ports {data2mem_wire_out[11]}]
set_load -pin_load -min 0.01 [get_ports {data2mem_wire_out[10]}]
set_load -pin_load -max 0.1 [get_ports {data2mem_wire_out[10]}]
set_load -pin_load -min 0.01 [get_ports {data2mem_wire_out[9]}]
set_load -pin_load -max 0.1 [get_ports {data2mem_wire_out[9]}]
set_load -pin_load -min 0.01 [get_ports {data2mem_wire_out[8]}]
set_load -pin_load -max 0.1 [get_ports {data2mem_wire_out[8]}]
set_load -pin_load -min 0.01 [get_ports {data2mem_wire_out[7]}]
set_load -pin_load -max 0.1 [get_ports {data2mem_wire_out[7]}]
set_load -pin_load -min 0.01 [get_ports {data2mem_wire_out[6]}]
set_load -pin_load -max 0.1 [get_ports {data2mem_wire_out[6]}]
set_load -pin_load -min 0.01 [get_ports {data2mem_wire_out[5]}]
set_load -pin_load -max 0.1 [get_ports {data2mem_wire_out[5]}]
set_load -pin_load -min 0.01 [get_ports {data2mem_wire_out[4]}]
set_load -pin_load -max 0.1 [get_ports {data2mem_wire_out[4]}]
set_load -pin_load -min 0.01 [get_ports {data2mem_wire_out[3]}]
set_load -pin_load -max 0.1 [get_ports {data2mem_wire_out[3]}]
set_load -pin_load -min 0.01 [get_ports {data2mem_wire_out[2]}]
set_load -pin_load -max 0.1 [get_ports {data2mem_wire_out[2]}]
set_load -pin_load -min 0.01 [get_ports {data2mem_wire_out[1]}]
set_load -pin_load -max 0.1 [get_ports {data2mem_wire_out[1]}]
set_load -pin_load -min 0.01 [get_ports {data2mem_wire_out[0]}]
set_load -pin_load -max 0.1 [get_ports {data2mem_wire_out[0]}]
set_load -pin_load -min 0.01 [get_ports {data4io_wire_out[31]}]
set_load -pin_load -max 0.1 [get_ports {data4io_wire_out[31]}]
set_load -pin_load -min 0.01 [get_ports {data4io_wire_out[30]}]
set_load -pin_load -max 0.1 [get_ports {data4io_wire_out[30]}]
set_load -pin_load -min 0.01 [get_ports {data4io_wire_out[29]}]
set_load -pin_load -max 0.1 [get_ports {data4io_wire_out[29]}]
set_load -pin_load -min 0.01 [get_ports {data4io_wire_out[28]}]
set_load -pin_load -max 0.1 [get_ports {data4io_wire_out[28]}]
set_load -pin_load -min 0.01 [get_ports {data4io_wire_out[27]}]
set_load -pin_load -max 0.1 [get_ports {data4io_wire_out[27]}]
set_load -pin_load -min 0.01 [get_ports {data4io_wire_out[26]}]
set_load -pin_load -max 0.1 [get_ports {data4io_wire_out[26]}]
set_load -pin_load -min 0.01 [get_ports {data4io_wire_out[25]}]
set_load -pin_load -max 0.1 [get_ports {data4io_wire_out[25]}]
set_load -pin_load -min 0.01 [get_ports {data4io_wire_out[24]}]
set_load -pin_load -max 0.1 [get_ports {data4io_wire_out[24]}]
set_load -pin_load -min 0.01 [get_ports {data4io_wire_out[23]}]
set_load -pin_load -max 0.1 [get_ports {data4io_wire_out[23]}]
set_load -pin_load -min 0.01 [get_ports {data4io_wire_out[22]}]
set_load -pin_load -max 0.1 [get_ports {data4io_wire_out[22]}]
set_load -pin_load -min 0.01 [get_ports {data4io_wire_out[21]}]
set_load -pin_load -max 0.1 [get_ports {data4io_wire_out[21]}]
set_load -pin_load -min 0.01 [get_ports {data4io_wire_out[20]}]
set_load -pin_load -max 0.1 [get_ports {data4io_wire_out[20]}]
set_load -pin_load -min 0.01 [get_ports {data4io_wire_out[19]}]
set_load -pin_load -max 0.1 [get_ports {data4io_wire_out[19]}]
set_load -pin_load -min 0.01 [get_ports {data4io_wire_out[18]}]
set_load -pin_load -max 0.1 [get_ports {data4io_wire_out[18]}]
set_load -pin_load -min 0.01 [get_ports {data4io_wire_out[17]}]
set_load -pin_load -max 0.1 [get_ports {data4io_wire_out[17]}]
set_load -pin_load -min 0.01 [get_ports {data4io_wire_out[16]}]
set_load -pin_load -max 0.1 [get_ports {data4io_wire_out[16]}]
set_load -pin_load -min 0.01 [get_ports {data4io_wire_out[15]}]
set_load -pin_load -max 0.1 [get_ports {data4io_wire_out[15]}]
set_load -pin_load -min 0.01 [get_ports {data4io_wire_out[14]}]
set_load -pin_load -max 0.1 [get_ports {data4io_wire_out[14]}]
set_load -pin_load -min 0.01 [get_ports {data4io_wire_out[13]}]
set_load -pin_load -max 0.1 [get_ports {data4io_wire_out[13]}]
set_load -pin_load -min 0.01 [get_ports {data4io_wire_out[12]}]
set_load -pin_load -max 0.1 [get_ports {data4io_wire_out[12]}]
set_load -pin_load -min 0.01 [get_ports {data4io_wire_out[11]}]
set_load -pin_load -max 0.1 [get_ports {data4io_wire_out[11]}]
set_load -pin_load -min 0.01 [get_ports {data4io_wire_out[10]}]
set_load -pin_load -max 0.1 [get_ports {data4io_wire_out[10]}]
set_load -pin_load -min 0.01 [get_ports {data4io_wire_out[9]}]
set_load -pin_load -max 0.1 [get_ports {data4io_wire_out[9]}]
set_load -pin_load -min 0.01 [get_ports {data4io_wire_out[8]}]
set_load -pin_load -max 0.1 [get_ports {data4io_wire_out[8]}]
set_load -pin_load -min 0.01 [get_ports {data4io_wire_out[7]}]
set_load -pin_load -max 0.1 [get_ports {data4io_wire_out[7]}]
set_load -pin_load -min 0.01 [get_ports {data4io_wire_out[6]}]
set_load -pin_load -max 0.1 [get_ports {data4io_wire_out[6]}]
set_load -pin_load -min 0.01 [get_ports {data4io_wire_out[5]}]
set_load -pin_load -max 0.1 [get_ports {data4io_wire_out[5]}]
set_load -pin_load -min 0.01 [get_ports {data4io_wire_out[4]}]
set_load -pin_load -max 0.1 [get_ports {data4io_wire_out[4]}]
set_load -pin_load -min 0.01 [get_ports {data4io_wire_out[3]}]
set_load -pin_load -max 0.1 [get_ports {data4io_wire_out[3]}]
set_load -pin_load -min 0.01 [get_ports {data4io_wire_out[2]}]
set_load -pin_load -max 0.1 [get_ports {data4io_wire_out[2]}]
set_load -pin_load -min 0.01 [get_ports {data4io_wire_out[1]}]
set_load -pin_load -max 0.1 [get_ports {data4io_wire_out[1]}]
set_load -pin_load -min 0.01 [get_ports {data4io_wire_out[0]}]
set_load -pin_load -max 0.1 [get_ports {data4io_wire_out[0]}]
set_load -pin_load -min 0.01 [get_ports {data2io_wire_out[31]}]
set_load -pin_load -max 0.1 [get_ports {data2io_wire_out[31]}]
set_load -pin_load -min 0.01 [get_ports {data2io_wire_out[30]}]
set_load -pin_load -max 0.1 [get_ports {data2io_wire_out[30]}]
set_load -pin_load -min 0.01 [get_ports {data2io_wire_out[29]}]
set_load -pin_load -max 0.1 [get_ports {data2io_wire_out[29]}]
set_load -pin_load -min 0.01 [get_ports {data2io_wire_out[28]}]
set_load -pin_load -max 0.1 [get_ports {data2io_wire_out[28]}]
set_load -pin_load -min 0.01 [get_ports {data2io_wire_out[27]}]
set_load -pin_load -max 0.1 [get_ports {data2io_wire_out[27]}]
set_load -pin_load -min 0.01 [get_ports {data2io_wire_out[26]}]
set_load -pin_load -max 0.1 [get_ports {data2io_wire_out[26]}]
set_load -pin_load -min 0.01 [get_ports {data2io_wire_out[25]}]
set_load -pin_load -max 0.1 [get_ports {data2io_wire_out[25]}]
set_load -pin_load -min 0.01 [get_ports {data2io_wire_out[24]}]
set_load -pin_load -max 0.1 [get_ports {data2io_wire_out[24]}]
set_load -pin_load -min 0.01 [get_ports {data2io_wire_out[23]}]
set_load -pin_load -max 0.1 [get_ports {data2io_wire_out[23]}]
set_load -pin_load -min 0.01 [get_ports {data2io_wire_out[22]}]
set_load -pin_load -max 0.1 [get_ports {data2io_wire_out[22]}]
set_load -pin_load -min 0.01 [get_ports {data2io_wire_out[21]}]
set_load -pin_load -max 0.1 [get_ports {data2io_wire_out[21]}]
set_load -pin_load -min 0.01 [get_ports {data2io_wire_out[20]}]
set_load -pin_load -max 0.1 [get_ports {data2io_wire_out[20]}]
set_load -pin_load -min 0.01 [get_ports {data2io_wire_out[19]}]
set_load -pin_load -max 0.1 [get_ports {data2io_wire_out[19]}]
set_load -pin_load -min 0.01 [get_ports {data2io_wire_out[18]}]
set_load -pin_load -max 0.1 [get_ports {data2io_wire_out[18]}]
set_load -pin_load -min 0.01 [get_ports {data2io_wire_out[17]}]
set_load -pin_load -max 0.1 [get_ports {data2io_wire_out[17]}]
set_load -pin_load -min 0.01 [get_ports {data2io_wire_out[16]}]
set_load -pin_load -max 0.1 [get_ports {data2io_wire_out[16]}]
set_load -pin_load -min 0.01 [get_ports {data2io_wire_out[15]}]
set_load -pin_load -max 0.1 [get_ports {data2io_wire_out[15]}]
set_load -pin_load -min 0.01 [get_ports {data2io_wire_out[14]}]
set_load -pin_load -max 0.1 [get_ports {data2io_wire_out[14]}]
set_load -pin_load -min 0.01 [get_ports {data2io_wire_out[13]}]
set_load -pin_load -max 0.1 [get_ports {data2io_wire_out[13]}]
set_load -pin_load -min 0.01 [get_ports {data2io_wire_out[12]}]
set_load -pin_load -max 0.1 [get_ports {data2io_wire_out[12]}]
set_load -pin_load -min 0.01 [get_ports {data2io_wire_out[11]}]
set_load -pin_load -max 0.1 [get_ports {data2io_wire_out[11]}]
set_load -pin_load -min 0.01 [get_ports {data2io_wire_out[10]}]
set_load -pin_load -max 0.1 [get_ports {data2io_wire_out[10]}]
set_load -pin_load -min 0.01 [get_ports {data2io_wire_out[9]}]
set_load -pin_load -max 0.1 [get_ports {data2io_wire_out[9]}]
set_load -pin_load -min 0.01 [get_ports {data2io_wire_out[8]}]
set_load -pin_load -max 0.1 [get_ports {data2io_wire_out[8]}]
set_load -pin_load -min 0.01 [get_ports {data2io_wire_out[7]}]
set_load -pin_load -max 0.1 [get_ports {data2io_wire_out[7]}]
set_load -pin_load -min 0.01 [get_ports {data2io_wire_out[6]}]
set_load -pin_load -max 0.1 [get_ports {data2io_wire_out[6]}]
set_load -pin_load -min 0.01 [get_ports {data2io_wire_out[5]}]
set_load -pin_load -max 0.1 [get_ports {data2io_wire_out[5]}]
set_load -pin_load -min 0.01 [get_ports {data2io_wire_out[4]}]
set_load -pin_load -max 0.1 [get_ports {data2io_wire_out[4]}]
set_load -pin_load -min 0.01 [get_ports {data2io_wire_out[3]}]
set_load -pin_load -max 0.1 [get_ports {data2io_wire_out[3]}]
set_load -pin_load -min 0.01 [get_ports {data2io_wire_out[2]}]
set_load -pin_load -max 0.1 [get_ports {data2io_wire_out[2]}]
set_load -pin_load -min 0.01 [get_ports {data2io_wire_out[1]}]
set_load -pin_load -max 0.1 [get_ports {data2io_wire_out[1]}]
set_load -pin_load -min 0.01 [get_ports {data2io_wire_out[0]}]
set_load -pin_load -max 0.1 [get_ports {data2io_wire_out[0]}]
set_false_path -from [get_ports {reset[0]}]
set_clock_gating_check -setup 0.0 
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data_addr_wire_out[31]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data_addr_wire_out[30]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data_addr_wire_out[29]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data_addr_wire_out[28]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data_addr_wire_out[27]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data_addr_wire_out[26]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data_addr_wire_out[25]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data_addr_wire_out[24]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data_addr_wire_out[23]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data_addr_wire_out[22]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data_addr_wire_out[21]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data_addr_wire_out[20]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data_addr_wire_out[19]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data_addr_wire_out[18]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data_addr_wire_out[17]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data_addr_wire_out[16]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data_addr_wire_out[15]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data_addr_wire_out[14]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data_addr_wire_out[13]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data_addr_wire_out[12]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data_addr_wire_out[11]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data_addr_wire_out[10]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data_addr_wire_out[9]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data_addr_wire_out[8]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data_addr_wire_out[7]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data_addr_wire_out[6]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data_addr_wire_out[5]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data_addr_wire_out[4]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data_addr_wire_out[3]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data_addr_wire_out[2]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data_addr_wire_out[1]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data_addr_wire_out[0]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports we_wire_out]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4mem_wire_out[31]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4mem_wire_out[30]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4mem_wire_out[29]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4mem_wire_out[28]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4mem_wire_out[27]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4mem_wire_out[26]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4mem_wire_out[25]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4mem_wire_out[24]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4mem_wire_out[23]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4mem_wire_out[22]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4mem_wire_out[21]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4mem_wire_out[20]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4mem_wire_out[19]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4mem_wire_out[18]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4mem_wire_out[17]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4mem_wire_out[16]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4mem_wire_out[15]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4mem_wire_out[14]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4mem_wire_out[13]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4mem_wire_out[12]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4mem_wire_out[11]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4mem_wire_out[10]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4mem_wire_out[9]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4mem_wire_out[8]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4mem_wire_out[7]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4mem_wire_out[6]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4mem_wire_out[5]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4mem_wire_out[4]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4mem_wire_out[3]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4mem_wire_out[2]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4mem_wire_out[1]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4mem_wire_out[0]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2mem_wire_out[31]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2mem_wire_out[30]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2mem_wire_out[29]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2mem_wire_out[28]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2mem_wire_out[27]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2mem_wire_out[26]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2mem_wire_out[25]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2mem_wire_out[24]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2mem_wire_out[23]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2mem_wire_out[22]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2mem_wire_out[21]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2mem_wire_out[20]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2mem_wire_out[19]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2mem_wire_out[18]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2mem_wire_out[17]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2mem_wire_out[16]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2mem_wire_out[15]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2mem_wire_out[14]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2mem_wire_out[13]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2mem_wire_out[12]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2mem_wire_out[11]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2mem_wire_out[10]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2mem_wire_out[9]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2mem_wire_out[8]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2mem_wire_out[7]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2mem_wire_out[6]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2mem_wire_out[5]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2mem_wire_out[4]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2mem_wire_out[3]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2mem_wire_out[2]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2mem_wire_out[1]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2mem_wire_out[0]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4io_wire_out[31]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4io_wire_out[30]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4io_wire_out[29]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4io_wire_out[28]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4io_wire_out[27]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4io_wire_out[26]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4io_wire_out[25]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4io_wire_out[24]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4io_wire_out[23]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4io_wire_out[22]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4io_wire_out[21]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4io_wire_out[20]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4io_wire_out[19]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4io_wire_out[18]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4io_wire_out[17]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4io_wire_out[16]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4io_wire_out[15]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4io_wire_out[14]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4io_wire_out[13]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4io_wire_out[12]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4io_wire_out[11]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4io_wire_out[10]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4io_wire_out[9]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4io_wire_out[8]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4io_wire_out[7]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4io_wire_out[6]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4io_wire_out[5]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4io_wire_out[4]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4io_wire_out[3]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4io_wire_out[2]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4io_wire_out[1]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data4io_wire_out[0]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2io_wire_out[31]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2io_wire_out[30]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2io_wire_out[29]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2io_wire_out[28]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2io_wire_out[27]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2io_wire_out[26]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2io_wire_out[25]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2io_wire_out[24]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2io_wire_out[23]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2io_wire_out[22]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2io_wire_out[21]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2io_wire_out[20]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2io_wire_out[19]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2io_wire_out[18]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2io_wire_out[17]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2io_wire_out[16]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2io_wire_out[15]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2io_wire_out[14]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2io_wire_out[13]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2io_wire_out[12]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2io_wire_out[11]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2io_wire_out[10]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2io_wire_out[9]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2io_wire_out[8]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2io_wire_out[7]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2io_wire_out[6]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2io_wire_out[5]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2io_wire_out[4]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2io_wire_out[3]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2io_wire_out[2]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2io_wire_out[1]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {data2io_wire_out[0]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data_addr_wire_out[31]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data_addr_wire_out[30]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data_addr_wire_out[29]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data_addr_wire_out[28]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data_addr_wire_out[27]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data_addr_wire_out[26]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data_addr_wire_out[25]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data_addr_wire_out[24]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data_addr_wire_out[23]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data_addr_wire_out[22]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data_addr_wire_out[21]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data_addr_wire_out[20]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data_addr_wire_out[19]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data_addr_wire_out[18]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data_addr_wire_out[17]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data_addr_wire_out[16]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data_addr_wire_out[15]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data_addr_wire_out[14]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data_addr_wire_out[13]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data_addr_wire_out[12]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data_addr_wire_out[11]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data_addr_wire_out[10]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data_addr_wire_out[9]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data_addr_wire_out[8]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data_addr_wire_out[7]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data_addr_wire_out[6]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data_addr_wire_out[5]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data_addr_wire_out[4]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data_addr_wire_out[3]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data_addr_wire_out[2]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data_addr_wire_out[1]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data_addr_wire_out[0]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports we_wire_out]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4mem_wire_out[31]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4mem_wire_out[30]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4mem_wire_out[29]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4mem_wire_out[28]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4mem_wire_out[27]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4mem_wire_out[26]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4mem_wire_out[25]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4mem_wire_out[24]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4mem_wire_out[23]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4mem_wire_out[22]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4mem_wire_out[21]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4mem_wire_out[20]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4mem_wire_out[19]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4mem_wire_out[18]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4mem_wire_out[17]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4mem_wire_out[16]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4mem_wire_out[15]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4mem_wire_out[14]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4mem_wire_out[13]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4mem_wire_out[12]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4mem_wire_out[11]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4mem_wire_out[10]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4mem_wire_out[9]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4mem_wire_out[8]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4mem_wire_out[7]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4mem_wire_out[6]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4mem_wire_out[5]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4mem_wire_out[4]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4mem_wire_out[3]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4mem_wire_out[2]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4mem_wire_out[1]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4mem_wire_out[0]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2mem_wire_out[31]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2mem_wire_out[30]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2mem_wire_out[29]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2mem_wire_out[28]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2mem_wire_out[27]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2mem_wire_out[26]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2mem_wire_out[25]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2mem_wire_out[24]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2mem_wire_out[23]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2mem_wire_out[22]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2mem_wire_out[21]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2mem_wire_out[20]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2mem_wire_out[19]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2mem_wire_out[18]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2mem_wire_out[17]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2mem_wire_out[16]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2mem_wire_out[15]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2mem_wire_out[14]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2mem_wire_out[13]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2mem_wire_out[12]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2mem_wire_out[11]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2mem_wire_out[10]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2mem_wire_out[9]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2mem_wire_out[8]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2mem_wire_out[7]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2mem_wire_out[6]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2mem_wire_out[5]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2mem_wire_out[4]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2mem_wire_out[3]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2mem_wire_out[2]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2mem_wire_out[1]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2mem_wire_out[0]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4io_wire_out[31]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4io_wire_out[30]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4io_wire_out[29]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4io_wire_out[28]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4io_wire_out[27]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4io_wire_out[26]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4io_wire_out[25]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4io_wire_out[24]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4io_wire_out[23]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4io_wire_out[22]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4io_wire_out[21]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4io_wire_out[20]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4io_wire_out[19]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4io_wire_out[18]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4io_wire_out[17]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4io_wire_out[16]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4io_wire_out[15]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4io_wire_out[14]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4io_wire_out[13]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4io_wire_out[12]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4io_wire_out[11]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4io_wire_out[10]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4io_wire_out[9]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4io_wire_out[8]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4io_wire_out[7]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4io_wire_out[6]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4io_wire_out[5]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4io_wire_out[4]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4io_wire_out[3]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4io_wire_out[2]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4io_wire_out[1]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data4io_wire_out[0]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2io_wire_out[31]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2io_wire_out[30]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2io_wire_out[29]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2io_wire_out[28]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2io_wire_out[27]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2io_wire_out[26]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2io_wire_out[25]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2io_wire_out[24]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2io_wire_out[23]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2io_wire_out[22]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2io_wire_out[21]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2io_wire_out[20]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2io_wire_out[19]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2io_wire_out[18]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2io_wire_out[17]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2io_wire_out[16]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2io_wire_out[15]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2io_wire_out[14]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2io_wire_out[13]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2io_wire_out[12]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2io_wire_out[11]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2io_wire_out[10]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2io_wire_out[9]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2io_wire_out[8]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2io_wire_out[7]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2io_wire_out[6]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2io_wire_out[5]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2io_wire_out[4]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2io_wire_out[3]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2io_wire_out[2]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2io_wire_out[1]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {data2io_wire_out[0]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {reset[0]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {reset[0]}]
set_operating_conditions PVT_1P8V_25C
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports clk]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {reset[0]}]
set_wire_load_mode "enclosed"
set_clock_latency  0.2 [get_clocks CLK]
set_clock_uncertainty -setup 0.3 [get_clocks CLK]
set_clock_uncertainty -hold 0.2 [get_clocks CLK]
