# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.19-s055_1 on Sat Dec 28 21:48:27 CET 2024

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design serv_synth_wrapper

create_clock -name "CLK" -period 1000.0 -waveform {0.0 500.0} [get_ports clk]
set_load -pin_load -min 0.01 [get_ports {o_ibus_adr[31]}]
set_load -pin_load -max 0.1 [get_ports {o_ibus_adr[31]}]
set_load -pin_load -min 0.01 [get_ports {o_ibus_adr[30]}]
set_load -pin_load -max 0.1 [get_ports {o_ibus_adr[30]}]
set_load -pin_load -min 0.01 [get_ports {o_ibus_adr[29]}]
set_load -pin_load -max 0.1 [get_ports {o_ibus_adr[29]}]
set_load -pin_load -min 0.01 [get_ports {o_ibus_adr[28]}]
set_load -pin_load -max 0.1 [get_ports {o_ibus_adr[28]}]
set_load -pin_load -min 0.01 [get_ports {o_ibus_adr[27]}]
set_load -pin_load -max 0.1 [get_ports {o_ibus_adr[27]}]
set_load -pin_load -min 0.01 [get_ports {o_ibus_adr[26]}]
set_load -pin_load -max 0.1 [get_ports {o_ibus_adr[26]}]
set_load -pin_load -min 0.01 [get_ports {o_ibus_adr[25]}]
set_load -pin_load -max 0.1 [get_ports {o_ibus_adr[25]}]
set_load -pin_load -min 0.01 [get_ports {o_ibus_adr[24]}]
set_load -pin_load -max 0.1 [get_ports {o_ibus_adr[24]}]
set_load -pin_load -min 0.01 [get_ports {o_ibus_adr[23]}]
set_load -pin_load -max 0.1 [get_ports {o_ibus_adr[23]}]
set_load -pin_load -min 0.01 [get_ports {o_ibus_adr[22]}]
set_load -pin_load -max 0.1 [get_ports {o_ibus_adr[22]}]
set_load -pin_load -min 0.01 [get_ports {o_ibus_adr[21]}]
set_load -pin_load -max 0.1 [get_ports {o_ibus_adr[21]}]
set_load -pin_load -min 0.01 [get_ports {o_ibus_adr[20]}]
set_load -pin_load -max 0.1 [get_ports {o_ibus_adr[20]}]
set_load -pin_load -min 0.01 [get_ports {o_ibus_adr[19]}]
set_load -pin_load -max 0.1 [get_ports {o_ibus_adr[19]}]
set_load -pin_load -min 0.01 [get_ports {o_ibus_adr[18]}]
set_load -pin_load -max 0.1 [get_ports {o_ibus_adr[18]}]
set_load -pin_load -min 0.01 [get_ports {o_ibus_adr[17]}]
set_load -pin_load -max 0.1 [get_ports {o_ibus_adr[17]}]
set_load -pin_load -min 0.01 [get_ports {o_ibus_adr[16]}]
set_load -pin_load -max 0.1 [get_ports {o_ibus_adr[16]}]
set_load -pin_load -min 0.01 [get_ports {o_ibus_adr[15]}]
set_load -pin_load -max 0.1 [get_ports {o_ibus_adr[15]}]
set_load -pin_load -min 0.01 [get_ports {o_ibus_adr[14]}]
set_load -pin_load -max 0.1 [get_ports {o_ibus_adr[14]}]
set_load -pin_load -min 0.01 [get_ports {o_ibus_adr[13]}]
set_load -pin_load -max 0.1 [get_ports {o_ibus_adr[13]}]
set_load -pin_load -min 0.01 [get_ports {o_ibus_adr[12]}]
set_load -pin_load -max 0.1 [get_ports {o_ibus_adr[12]}]
set_load -pin_load -min 0.01 [get_ports {o_ibus_adr[11]}]
set_load -pin_load -max 0.1 [get_ports {o_ibus_adr[11]}]
set_load -pin_load -min 0.01 [get_ports {o_ibus_adr[10]}]
set_load -pin_load -max 0.1 [get_ports {o_ibus_adr[10]}]
set_load -pin_load -min 0.01 [get_ports {o_ibus_adr[9]}]
set_load -pin_load -max 0.1 [get_ports {o_ibus_adr[9]}]
set_load -pin_load -min 0.01 [get_ports {o_ibus_adr[8]}]
set_load -pin_load -max 0.1 [get_ports {o_ibus_adr[8]}]
set_load -pin_load -min 0.01 [get_ports {o_ibus_adr[7]}]
set_load -pin_load -max 0.1 [get_ports {o_ibus_adr[7]}]
set_load -pin_load -min 0.01 [get_ports {o_ibus_adr[6]}]
set_load -pin_load -max 0.1 [get_ports {o_ibus_adr[6]}]
set_load -pin_load -min 0.01 [get_ports {o_ibus_adr[5]}]
set_load -pin_load -max 0.1 [get_ports {o_ibus_adr[5]}]
set_load -pin_load -min 0.01 [get_ports {o_ibus_adr[4]}]
set_load -pin_load -max 0.1 [get_ports {o_ibus_adr[4]}]
set_load -pin_load -min 0.01 [get_ports {o_ibus_adr[3]}]
set_load -pin_load -max 0.1 [get_ports {o_ibus_adr[3]}]
set_load -pin_load -min 0.01 [get_ports {o_ibus_adr[2]}]
set_load -pin_load -max 0.1 [get_ports {o_ibus_adr[2]}]
set_load -pin_load -min 0.01 [get_ports {o_ibus_adr[1]}]
set_load -pin_load -max 0.1 [get_ports {o_ibus_adr[1]}]
set_load -pin_load -min 0.01 [get_ports {o_ibus_adr[0]}]
set_load -pin_load -max 0.1 [get_ports {o_ibus_adr[0]}]
set_load -pin_load -min 0.01 [get_ports o_ibus_cyc]
set_load -pin_load -max 0.1 [get_ports o_ibus_cyc]
set_load -pin_load -min 0.01 [get_ports {o_dbus_adr[31]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_adr[31]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_adr[30]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_adr[30]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_adr[29]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_adr[29]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_adr[28]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_adr[28]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_adr[27]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_adr[27]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_adr[26]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_adr[26]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_adr[25]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_adr[25]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_adr[24]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_adr[24]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_adr[23]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_adr[23]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_adr[22]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_adr[22]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_adr[21]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_adr[21]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_adr[20]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_adr[20]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_adr[19]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_adr[19]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_adr[18]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_adr[18]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_adr[17]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_adr[17]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_adr[16]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_adr[16]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_adr[15]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_adr[15]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_adr[14]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_adr[14]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_adr[13]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_adr[13]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_adr[12]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_adr[12]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_adr[11]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_adr[11]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_adr[10]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_adr[10]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_adr[9]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_adr[9]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_adr[8]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_adr[8]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_adr[7]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_adr[7]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_adr[6]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_adr[6]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_adr[5]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_adr[5]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_adr[4]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_adr[4]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_adr[3]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_adr[3]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_adr[2]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_adr[2]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_adr[1]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_adr[1]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_adr[0]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_adr[0]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_dat[31]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_dat[31]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_dat[30]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_dat[30]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_dat[29]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_dat[29]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_dat[28]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_dat[28]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_dat[27]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_dat[27]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_dat[26]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_dat[26]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_dat[25]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_dat[25]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_dat[24]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_dat[24]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_dat[23]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_dat[23]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_dat[22]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_dat[22]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_dat[21]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_dat[21]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_dat[20]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_dat[20]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_dat[19]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_dat[19]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_dat[18]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_dat[18]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_dat[17]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_dat[17]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_dat[16]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_dat[16]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_dat[15]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_dat[15]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_dat[14]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_dat[14]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_dat[13]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_dat[13]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_dat[12]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_dat[12]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_dat[11]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_dat[11]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_dat[10]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_dat[10]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_dat[9]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_dat[9]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_dat[8]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_dat[8]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_dat[7]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_dat[7]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_dat[6]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_dat[6]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_dat[5]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_dat[5]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_dat[4]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_dat[4]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_dat[3]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_dat[3]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_dat[2]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_dat[2]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_dat[1]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_dat[1]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_dat[0]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_dat[0]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_sel[3]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_sel[3]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_sel[2]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_sel[2]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_sel[1]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_sel[1]}]
set_load -pin_load -min 0.01 [get_ports {o_dbus_sel[0]}]
set_load -pin_load -max 0.1 [get_ports {o_dbus_sel[0]}]
set_load -pin_load -min 0.01 [get_ports o_dbus_we]
set_load -pin_load -max 0.1 [get_ports o_dbus_we]
set_load -pin_load -min 0.01 [get_ports o_dbus_cyc]
set_load -pin_load -max 0.1 [get_ports o_dbus_cyc]
set_load -pin_load -min 0.01 [get_ports {o_waddr[9]}]
set_load -pin_load -max 0.1 [get_ports {o_waddr[9]}]
set_load -pin_load -min 0.01 [get_ports {o_waddr[8]}]
set_load -pin_load -max 0.1 [get_ports {o_waddr[8]}]
set_load -pin_load -min 0.01 [get_ports {o_waddr[7]}]
set_load -pin_load -max 0.1 [get_ports {o_waddr[7]}]
set_load -pin_load -min 0.01 [get_ports {o_waddr[6]}]
set_load -pin_load -max 0.1 [get_ports {o_waddr[6]}]
set_load -pin_load -min 0.01 [get_ports {o_waddr[5]}]
set_load -pin_load -max 0.1 [get_ports {o_waddr[5]}]
set_load -pin_load -min 0.01 [get_ports {o_waddr[4]}]
set_load -pin_load -max 0.1 [get_ports {o_waddr[4]}]
set_load -pin_load -min 0.01 [get_ports {o_waddr[3]}]
set_load -pin_load -max 0.1 [get_ports {o_waddr[3]}]
set_load -pin_load -min 0.01 [get_ports {o_waddr[2]}]
set_load -pin_load -max 0.1 [get_ports {o_waddr[2]}]
set_load -pin_load -min 0.01 [get_ports {o_waddr[1]}]
set_load -pin_load -max 0.1 [get_ports {o_waddr[1]}]
set_load -pin_load -min 0.01 [get_ports {o_waddr[0]}]
set_load -pin_load -max 0.1 [get_ports {o_waddr[0]}]
set_load -pin_load -min 0.01 [get_ports {o_wdata[1]}]
set_load -pin_load -max 0.1 [get_ports {o_wdata[1]}]
set_load -pin_load -min 0.01 [get_ports {o_wdata[0]}]
set_load -pin_load -max 0.1 [get_ports {o_wdata[0]}]
set_load -pin_load -min 0.01 [get_ports o_wen]
set_load -pin_load -max 0.1 [get_ports o_wen]
set_load -pin_load -min 0.01 [get_ports {o_raddr[9]}]
set_load -pin_load -max 0.1 [get_ports {o_raddr[9]}]
set_load -pin_load -min 0.01 [get_ports {o_raddr[8]}]
set_load -pin_load -max 0.1 [get_ports {o_raddr[8]}]
set_load -pin_load -min 0.01 [get_ports {o_raddr[7]}]
set_load -pin_load -max 0.1 [get_ports {o_raddr[7]}]
set_load -pin_load -min 0.01 [get_ports {o_raddr[6]}]
set_load -pin_load -max 0.1 [get_ports {o_raddr[6]}]
set_load -pin_load -min 0.01 [get_ports {o_raddr[5]}]
set_load -pin_load -max 0.1 [get_ports {o_raddr[5]}]
set_load -pin_load -min 0.01 [get_ports {o_raddr[4]}]
set_load -pin_load -max 0.1 [get_ports {o_raddr[4]}]
set_load -pin_load -min 0.01 [get_ports {o_raddr[3]}]
set_load -pin_load -max 0.1 [get_ports {o_raddr[3]}]
set_load -pin_load -min 0.01 [get_ports {o_raddr[2]}]
set_load -pin_load -max 0.1 [get_ports {o_raddr[2]}]
set_load -pin_load -min 0.01 [get_ports {o_raddr[1]}]
set_load -pin_load -max 0.1 [get_ports {o_raddr[1]}]
set_load -pin_load -min 0.01 [get_ports {o_raddr[0]}]
set_load -pin_load -max 0.1 [get_ports {o_raddr[0]}]
set_false_path -from [get_ports i_rst]
set_clock_gating_check -setup 0.0 
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_ibus_adr[31]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_ibus_adr[30]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_ibus_adr[29]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_ibus_adr[28]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_ibus_adr[27]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_ibus_adr[26]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_ibus_adr[25]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_ibus_adr[24]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_ibus_adr[23]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_ibus_adr[22]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_ibus_adr[21]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_ibus_adr[20]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_ibus_adr[19]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_ibus_adr[18]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_ibus_adr[17]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_ibus_adr[16]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_ibus_adr[15]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_ibus_adr[14]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_ibus_adr[13]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_ibus_adr[12]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_ibus_adr[11]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_ibus_adr[10]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_ibus_adr[9]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_ibus_adr[8]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_ibus_adr[7]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_ibus_adr[6]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_ibus_adr[5]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_ibus_adr[4]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_ibus_adr[3]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_ibus_adr[2]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_ibus_adr[1]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_ibus_adr[0]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports o_ibus_cyc]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_adr[31]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_adr[30]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_adr[29]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_adr[28]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_adr[27]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_adr[26]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_adr[25]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_adr[24]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_adr[23]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_adr[22]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_adr[21]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_adr[20]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_adr[19]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_adr[18]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_adr[17]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_adr[16]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_adr[15]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_adr[14]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_adr[13]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_adr[12]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_adr[11]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_adr[10]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_adr[9]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_adr[8]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_adr[7]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_adr[6]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_adr[5]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_adr[4]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_adr[3]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_adr[2]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_adr[1]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_adr[0]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_dat[31]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_dat[30]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_dat[29]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_dat[28]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_dat[27]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_dat[26]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_dat[25]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_dat[24]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_dat[23]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_dat[22]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_dat[21]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_dat[20]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_dat[19]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_dat[18]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_dat[17]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_dat[16]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_dat[15]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_dat[14]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_dat[13]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_dat[12]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_dat[11]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_dat[10]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_dat[9]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_dat[8]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_dat[7]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_dat[6]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_dat[5]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_dat[4]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_dat[3]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_dat[2]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_dat[1]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_dat[0]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_sel[3]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_sel[2]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_sel[1]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_dbus_sel[0]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports o_dbus_we]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports o_dbus_cyc]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_waddr[9]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_waddr[8]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_waddr[7]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_waddr[6]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_waddr[5]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_waddr[4]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_waddr[3]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_waddr[2]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_waddr[1]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_waddr[0]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_wdata[1]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_wdata[0]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports o_wen]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_raddr[9]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_raddr[8]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_raddr[7]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_raddr[6]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_raddr[5]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_raddr[4]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_raddr[3]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_raddr[2]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_raddr[1]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {o_raddr[0]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_ibus_adr[31]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_ibus_adr[30]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_ibus_adr[29]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_ibus_adr[28]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_ibus_adr[27]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_ibus_adr[26]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_ibus_adr[25]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_ibus_adr[24]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_ibus_adr[23]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_ibus_adr[22]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_ibus_adr[21]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_ibus_adr[20]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_ibus_adr[19]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_ibus_adr[18]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_ibus_adr[17]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_ibus_adr[16]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_ibus_adr[15]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_ibus_adr[14]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_ibus_adr[13]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_ibus_adr[12]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_ibus_adr[11]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_ibus_adr[10]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_ibus_adr[9]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_ibus_adr[8]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_ibus_adr[7]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_ibus_adr[6]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_ibus_adr[5]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_ibus_adr[4]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_ibus_adr[3]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_ibus_adr[2]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_ibus_adr[1]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_ibus_adr[0]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports o_ibus_cyc]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_adr[31]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_adr[30]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_adr[29]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_adr[28]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_adr[27]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_adr[26]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_adr[25]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_adr[24]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_adr[23]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_adr[22]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_adr[21]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_adr[20]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_adr[19]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_adr[18]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_adr[17]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_adr[16]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_adr[15]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_adr[14]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_adr[13]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_adr[12]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_adr[11]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_adr[10]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_adr[9]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_adr[8]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_adr[7]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_adr[6]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_adr[5]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_adr[4]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_adr[3]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_adr[2]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_adr[1]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_adr[0]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_dat[31]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_dat[30]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_dat[29]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_dat[28]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_dat[27]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_dat[26]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_dat[25]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_dat[24]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_dat[23]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_dat[22]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_dat[21]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_dat[20]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_dat[19]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_dat[18]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_dat[17]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_dat[16]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_dat[15]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_dat[14]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_dat[13]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_dat[12]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_dat[11]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_dat[10]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_dat[9]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_dat[8]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_dat[7]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_dat[6]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_dat[5]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_dat[4]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_dat[3]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_dat[2]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_dat[1]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_dat[0]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_sel[3]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_sel[2]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_sel[1]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_dbus_sel[0]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports o_dbus_we]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports o_dbus_cyc]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_waddr[9]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_waddr[8]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_waddr[7]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_waddr[6]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_waddr[5]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_waddr[4]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_waddr[3]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_waddr[2]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_waddr[1]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_waddr[0]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_wdata[1]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_wdata[0]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports o_wen]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_raddr[9]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_raddr[8]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_raddr[7]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_raddr[6]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_raddr[5]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_raddr[4]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_raddr[3]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_raddr[2]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_raddr[1]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {o_raddr[0]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports i_rst]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports i_timer_irq]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_ibus_rdt[31]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_ibus_rdt[30]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_ibus_rdt[29]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_ibus_rdt[28]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_ibus_rdt[27]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_ibus_rdt[26]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_ibus_rdt[25]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_ibus_rdt[24]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_ibus_rdt[23]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_ibus_rdt[22]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_ibus_rdt[21]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_ibus_rdt[20]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_ibus_rdt[19]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_ibus_rdt[18]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_ibus_rdt[17]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_ibus_rdt[16]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_ibus_rdt[15]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_ibus_rdt[14]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_ibus_rdt[13]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_ibus_rdt[12]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_ibus_rdt[11]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_ibus_rdt[10]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_ibus_rdt[9]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_ibus_rdt[8]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_ibus_rdt[7]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_ibus_rdt[6]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_ibus_rdt[5]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_ibus_rdt[4]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_ibus_rdt[3]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_ibus_rdt[2]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_ibus_rdt[1]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_ibus_rdt[0]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports i_ibus_ack]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_dbus_rdt[31]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_dbus_rdt[30]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_dbus_rdt[29]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_dbus_rdt[28]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_dbus_rdt[27]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_dbus_rdt[26]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_dbus_rdt[25]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_dbus_rdt[24]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_dbus_rdt[23]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_dbus_rdt[22]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_dbus_rdt[21]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_dbus_rdt[20]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_dbus_rdt[19]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_dbus_rdt[18]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_dbus_rdt[17]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_dbus_rdt[16]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_dbus_rdt[15]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_dbus_rdt[14]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_dbus_rdt[13]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_dbus_rdt[12]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_dbus_rdt[11]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_dbus_rdt[10]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_dbus_rdt[9]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_dbus_rdt[8]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_dbus_rdt[7]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_dbus_rdt[6]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_dbus_rdt[5]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_dbus_rdt[4]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_dbus_rdt[3]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_dbus_rdt[2]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_dbus_rdt[1]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_dbus_rdt[0]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports i_dbus_ack]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_rdata[1]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 0.2 [get_ports {i_rdata[0]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports i_rst]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports i_timer_irq]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_ibus_rdt[31]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_ibus_rdt[30]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_ibus_rdt[29]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_ibus_rdt[28]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_ibus_rdt[27]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_ibus_rdt[26]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_ibus_rdt[25]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_ibus_rdt[24]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_ibus_rdt[23]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_ibus_rdt[22]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_ibus_rdt[21]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_ibus_rdt[20]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_ibus_rdt[19]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_ibus_rdt[18]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_ibus_rdt[17]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_ibus_rdt[16]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_ibus_rdt[15]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_ibus_rdt[14]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_ibus_rdt[13]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_ibus_rdt[12]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_ibus_rdt[11]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_ibus_rdt[10]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_ibus_rdt[9]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_ibus_rdt[8]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_ibus_rdt[7]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_ibus_rdt[6]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_ibus_rdt[5]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_ibus_rdt[4]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_ibus_rdt[3]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_ibus_rdt[2]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_ibus_rdt[1]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_ibus_rdt[0]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports i_ibus_ack]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_dbus_rdt[31]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_dbus_rdt[30]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_dbus_rdt[29]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_dbus_rdt[28]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_dbus_rdt[27]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_dbus_rdt[26]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_dbus_rdt[25]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_dbus_rdt[24]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_dbus_rdt[23]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_dbus_rdt[22]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_dbus_rdt[21]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_dbus_rdt[20]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_dbus_rdt[19]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_dbus_rdt[18]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_dbus_rdt[17]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_dbus_rdt[16]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_dbus_rdt[15]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_dbus_rdt[14]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_dbus_rdt[13]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_dbus_rdt[12]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_dbus_rdt[11]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_dbus_rdt[10]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_dbus_rdt[9]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_dbus_rdt[8]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_dbus_rdt[7]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_dbus_rdt[6]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_dbus_rdt[5]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_dbus_rdt[4]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_dbus_rdt[3]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_dbus_rdt[2]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_dbus_rdt[1]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_dbus_rdt[0]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports i_dbus_ack]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_rdata[1]}]
set_input_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {i_rdata[0]}]
set_operating_conditions PVT_1P8V_25C
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports clk]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports i_rst]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports i_timer_irq]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_ibus_rdt[31]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_ibus_rdt[30]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_ibus_rdt[29]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_ibus_rdt[28]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_ibus_rdt[27]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_ibus_rdt[26]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_ibus_rdt[25]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_ibus_rdt[24]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_ibus_rdt[23]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_ibus_rdt[22]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_ibus_rdt[21]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_ibus_rdt[20]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_ibus_rdt[19]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_ibus_rdt[18]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_ibus_rdt[17]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_ibus_rdt[16]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_ibus_rdt[15]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_ibus_rdt[14]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_ibus_rdt[13]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_ibus_rdt[12]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_ibus_rdt[11]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_ibus_rdt[10]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_ibus_rdt[9]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_ibus_rdt[8]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_ibus_rdt[7]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_ibus_rdt[6]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_ibus_rdt[5]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_ibus_rdt[4]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_ibus_rdt[3]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_ibus_rdt[2]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_ibus_rdt[1]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_ibus_rdt[0]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports i_ibus_ack]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_dbus_rdt[31]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_dbus_rdt[30]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_dbus_rdt[29]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_dbus_rdt[28]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_dbus_rdt[27]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_dbus_rdt[26]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_dbus_rdt[25]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_dbus_rdt[24]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_dbus_rdt[23]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_dbus_rdt[22]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_dbus_rdt[21]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_dbus_rdt[20]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_dbus_rdt[19]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_dbus_rdt[18]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_dbus_rdt[17]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_dbus_rdt[16]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_dbus_rdt[15]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_dbus_rdt[14]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_dbus_rdt[13]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_dbus_rdt[12]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_dbus_rdt[11]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_dbus_rdt[10]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_dbus_rdt[9]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_dbus_rdt[8]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_dbus_rdt[7]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_dbus_rdt[6]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_dbus_rdt[5]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_dbus_rdt[4]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_dbus_rdt[3]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_dbus_rdt[2]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_dbus_rdt[1]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_dbus_rdt[0]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports i_dbus_ack]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_rdata[1]}]
set_driving_cell -lib_cell BUFX2 -library KISTA_SOI_STDLIB2_CCS_TT -pin "Y" [get_ports {i_rdata[0]}]
set_wire_load_mode "enclosed"
set_clock_latency  0.2 [get_clocks CLK]
set_clock_uncertainty -setup 0.3 [get_clocks CLK]
set_clock_uncertainty -hold 0.2 [get_clocks CLK]
